1s/ERP/Conf/Documents/Лико_ЗаявкаНаГравировкуВалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаявкаНаГравировкуВалов</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ЗаявкиНаГравировкуВалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыОперацийЗаявокНаГравировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Валы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыОперацийЗаявокНаГравировку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыОперацийЗаявокНаГравировку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Гравировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходБолванок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаБезГравировки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаявкаНаГравировкуВалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заказ") И Параметры.Свойство("ВалФорма") Тогда
		Объект.ВидОперации = Перечисления.Лико_ВидыОперацийЗаявокНаГравировку.Гравировка;		
		Объект.ЗаказКлиента = Параметры.Заказ;
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Объект.Организация = Параметры.Заказ.Площадка.Организация;
		Объект.Площадка = Параметры.Заказ.Площадка;
		Для Каждого ЭлМассива Из Параметры.ВалФорма Цикл
			НоваяСтрока = Объект.Валы.Добавить();
			НоваяСтрока.Вал = ЭлМассива.Вал;
			НоваяСтрока.Форма = ЭлМассива.Форма;
		КонецЦикла;
	КонецЕсли;
	
	ДобавитьУсловноеОформлениеЦветаВалФорма();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеЦветаВалФорма() 
	
	МассивУсловногоОформленияВалФорма = Новый Массив();	
	Для каждого Элемент Из УсловноеОформление.Элементы Цикл
		Если Строка(Элемент.Поля) = "ВалыВал" ИЛИ Строка(Элемент.Поля) = "ВалыФорма" Тогда
			МассивУсловногоОформленияВалФорма.Добавить(Элемент);	
		КонецЕсли;
	КонецЦикла;
	Для каждого ЭлементМассива Из МассивУсловногоОформленияВалФорма Цикл
		УсловноеОформление.Элементы.Удалить(ЭлементМассива);	
	КонецЦикла;
	
	Для каждого Стр Из Объект.Валы Цикл
		Если ЗначениеЗаполнено(Стр.Вал) Тогда
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВалыВал");
			ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Валы.НомерСтроки");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.НомерСтроки; 
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Валы.Вал");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Стр.Вал.Артикул);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Форма) Тогда
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВалыФорма");
			ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Валы.НомерСтроки");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.НомерСтроки; 
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Валы.Форма");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Стр.Форма.Код);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 


&НаКлиенте
Процедура ВалыВалПриИзменении(Элемент)
	ДобавитьУсловноеОформлениеЦветаВалФорма();
КонецПроцедуры


&НаКлиенте
Процедура ВалыФормаПриИзменении(Элемент)
	ДобавитьУсловноеОформлениеЦветаВалФорма();
КонецПроцедуры


&НаКлиенте
Процедура ВалыПриИзменении(Элемент)
	ДобавитьУсловноеОформлениеЦветаВалФорма();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан ""Вид операции""";
		Сообщение.Поле = "ВидОперации"; //имя реквизита 
		Сообщение.ПутьКДанным = "Объект.ВидОперации";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
	Для Каждого Стр Из Объект.Валы Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Вал) Тогда
			Сообщить("Вид операции - " + Объект.ВидОперации + ". Не заполнен Вал в строке " + Стр.НомерСтроки + ". Заполните или удалите строку");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.Форма) И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ВидыОперацийЗаявокНаГравировку.Гравировка") Тогда
			Сообщить("Вид операции - " + Объект.ВидОперации + ". Не заполнеа Форма в строке " + Стр.НомерСтроки + ". Заполните или удалите строку");
			Отказ = Истина;
		КонецЕсли;
	Конеццикла; 
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры
